<template>
   <div>
      <br><br><br><br>
      <v-container fluid grid-list-sm pl-0 pr-0>
      <v-layout row wrap justify-center>
         <v-flex v-for="(item,i) in items" :key="`service${i}`" xs12 sm12 md6 pa-2>
           <v-card elevation="5">      
            <h3 class="display-1 mb-0 text-xs-center">{{item.title}}</h3>
            <v-img :src="item.img" aspect-ratio="4"></v-img>
            <v-card-title primary-title>
              <p v-for="(txt,i) in item.text" :key="`text${i}`" class="body-1 grey--text">{{txt}}</p>
            </v-card-title>
          </v-card>
         </v-flex>
      </v-layout>
   </v-container>
   </div>
</template>

<script>
import Img1 from '../assets/service/1.jpg'
import Img2 from '../assets/service/2.jpg'
import Img3 from '../assets/service/3.jpg'
import Img4 from '../assets/service/4.jpg'
import Img5 from '../assets/service/5.jpg'
import Img6 from '../assets/service/6.jpg'
import Img7 from '../assets/service/7.jpg'

export default {
 data: () => ({
      items: [
        { 
          title: 'Диагностика электронных систем', img: Img1, text: [
          'В нашем центре мы готовы взять на себя ответственность за качественный ремонт и диагностику гибридных автомобилей (HYBRID) и систем непосредственного впрыска топлива (D4, GDI, Neo Di). Хотите, чтобы ваш «подуставший» Prius вспомнил свои прямые обязанности по динамичной и экономичной езде – доверьте его нашим заботливым рукам!',
          'В нашем центре мы производим детальную локализацию неисправностей, максимально сужая контур работ, направленных на устранение дефектов без ущерба для эффективности ремонта. Всё начинается на стадии «дифференциального» диагноза. Если неисправность является «типичной» для данной модели автомобиля, мы не будем прогонять вас по «бюрократической лестнице» полной диагностики, начиная с наиболее вероятных причин поломки, однако, в случае объективных причин, укажем на необходимость дополнительных проверок или работ.',
          'На участке диагностики электронных систем автомобиля наши сотрудники опираются на официальные протоколы пошаговой локализации неисправностей, имея на вооружении все необходимое для измерений и проверки оборудование, производят ремонт и дефектовку электронных схем, а также исполнительных механизмов и устройств, работа которых корректируется электронными системами. Основная задача участка диагностики – экономить ваши средства и время, расставляя верные акценты и исключая лишние работы и покупку ненужных запчастей.',
          'Список систем, диагностируемых в нашем центре, перечислять не нужно во избежание игры непонятных аббревиатур, — всё, установленное заводом-изготовителем, электронное оборудование вашего автомобиля, все вспомогательные системы, всё, где течёт ток!',
          '*Отдельное внимание мы уделяем электронным системам повышенной сложности!'
          ] 
        },
        {
          title: 'Жестяно-сварочные и кузовные работы', img: Img2, text: [
          'Станция кузовного ремонта "TOYOTA на Герцена", оборудованная по последнему слову техники, осуществляет как текущий кузовной ремонт автомобиля, устранение мелких повреждений, так и капитальный ремонт кузова автомобиля, предполагающий восстановление 80% поверхности кузова.',
          'Жестянка, подготовка и покраска производятся на специально оборудованных участках.',
          'Наш персонал это мастера с многолетним стажем, обладают необходимым опытом и знаниями, которые совершенствуются на курсах повышения квалификации. Мастера станции кузовного ремонта автомобилей совершенствуют профессиональные навыки согласно рекомендациям заводов-изготовителей, что обеспечивает полное соблюдение технологий при выполнении кузовного ремонта автомобилей.',
          'Локальный кузовной ремонт - Локальный ремонт кузова автомобиля применяется для удаления сколов и царапин только в области повреждения, при этом сохраняется заводская краска на основной поверхности детали автомобиля, а места в которых производился локальный кузовной ремонт практически незаметны.',
          'Ремонт сколов и царапин - качественное удаление сколов и царапин занимает немало времени, так как во многих случаях появляется необходимость в грунтовке и шпатлевке детали с последующей покраской и лакировкой. Также ремонт царапин может производиться как с локальной покраской места царапины или, так и с покраской всей детали, так как удаление царапин и сколов на видимых деталях (двери, капот, крылья, багажник, крыша)могут привести к появлению скрытых «ореолов».',
          'Геометрия кузова - геометрия кузова автомобиля рассчитывается по контрольным точкам, которые определяет производитель данного автомобиля. Для того чтобы восстановить геометрию кузова необходимо специальное оборудование. С помощью специализированных измерительных систем, проводится проверка геометрии кузова Высококачественное оборудование дает возможность обеспечить 100% устранение перекоса кузова любой сложности. Сварные швы и все элементы, подлежащие замене или подвергшиеся в процессе ремонта нагреву, подлежат обязательной антикоррозийной обработке.',
          'Наши специалисты бесплатно проконсультируют Вас по всем возможностям локального ремонта кузова.'
          ] 
        },
        {
          title: 'Моторный участок', img: Img3, text: [
          'В нашем автотехцентре специалисты высокого класса с многолетним опытом работы осуществляют ремонт двигателей любых марок и разных уровней сложности – от простых 4-х цилиндровых до V-образных, бензиновых, дизельных и инжекторных.',
          'После проведения компьютерной диагностики ДВС и общей внутренней диагностики ДВС наши мастера выполняют ремонт, начиная от настроек топливной системы и заканчивая капитальным ремонтом двигателя внутреннего сгорания. Повышенный расход масла, снижение давления или стук в двигателе уже являются показателем неисправности. Если увеличился расход топлива при падении мощности, значит, вышла из строя система питания, требуют чистки система охлаждения, газораспределения, впуска либо поднятие уровня компрессии в цилиндрах.',
          'Мы проводим считывание кодов, проверку давления топлива, проверку электронной части системы питания, систем в/в зажигания, смесеобразования, угла опережения зажигания, регулировку момента впрыска, осмотр зеркала цилиндра и камеры сгорания.',
          'По результатам диагностики у нас вы можете осуществить переборка дозаторов-распределителей механического впрыска (с заменой уплотнительных колец и плунжерных пар), жидкостную очистку систем питания двигателя (без демонтажа инжекторов), чистку впускного тракта, клапанов и камер сгорания ДВС, чистку впускного коллектора, клапана (мотора) дополнительной подачи топлива.',
          'Разбор двигателя и соответствующий ремонт занимает иногда времени больше, чем кузовные работы, так как требует особого внимания к подбору деталей, механической обработке отдельных запчастей (шлифовка ГБЦ, гильзовка БЦ и т.д.) и точной отладке всей системы в целом.',
          'Однако, нашим мастерам стоит доверить свой автомобиль, получить отличный результат и гарантию на все выполненные работы.'
          ] 
        },
        {
          title: 'Сход-развал', img: Img4, text: [
          'Правильность постановки колес может нарушаться вследствие вмешательства в ходовую часть, а также по причине износа резины, неправильного давления в шинах, люфтов в шарнирах и сочленениях. В итоге машина плохо слушается водителя, может повести себя непредсказуемо, утратить управляемость.',
          'В подобных ситуациях нужно правильно выставить сход-развал (у большинства современных авто также регулируется кастер). Процедура подразумевает установку колес под заданным углом относительно подвески и кузова.',
          'При нулевом развале износ покрышек минимален, что увеличивает срок их службы. При отрицательном значении улучшается устойчивость машины при прохождении поворотов.',
          'Сход (схождение) — параметр, который регулируется одновременно с развалом и характеризует угол, образуемый между плоскостью вращения колеса и направлением движения. В некоторых машинах он регулируется как на передней, так и на задней оси. Неправильное его значение часто становится причиной ускоренного и повышенного износа резины.',
          ] 
        },
        {
          title: 'Слесарный участок', img: Img5, text: [
          'Техобслуживание автомобиля (ТО)Уважаемые клиенты, автотехцентр TOYODA на Герцена предлагает свои услуги по полному техническому обслуживанию автомобиля. ',
          'Техобслуживание автомобиля (ТО) производится комплексно, быстро, на новейшем оборудовании, высококлассным мастером. При проведении планового технического обслуживания автомобиля, мастер слесарного цеха выполнит замену всех отработанных жидкостей, фильтров, тормозных колодок, пыльников, прокладок и т. д. Произведет все профилактические работы, которые требуются для данного автомобиля.',
          'Несвоевременность прохождения технического обслуживания может негативно отразиться на автомобиле, а также на безопасности его управления. Не стоит нарушать интервалы ТО, ведь при внезапной поломке автомобиля затраты, как правило, становятся несопоставимы со стоимостью ТО, поэтому лучше предупредить поломку, чем быть застигнутым врасплох неожиданной поломкой своего автомобиля.'
          ] 
        },
        {
          title: 'Замена рабочих жидкостей', img: Img7, text: [
          'В нашем тех. центре мы оказываем полный спектр услуг по техническому обслуживанию и эксплуатации вашего автомобиля. Такие работы как: замена масла в АКПП, ДВС, ГУР, замена тормозной жидкости, замена охлаждающей жидкости,- требуют соблюдения эксплуатационных интервалов, необходимых для корректной и надежной работы вашего автомобиля.',
          ] 
        },
        {
          title: 'Антиаллергенная обработка', img: Img6, text: [
          'Многим владельцам автомобилей знаком неприятный запах, возникающий в первые минуты работы кондиционера. Причина этого запаха ясна и понятна. Во время работы кондиционера на холодном испарителе конденсируется влага, к капелькам воды прилипает пыль, пыльца растений, и со временем на всей поверхности испарителя образуется налет. Когда кондиционер не работает, температура на его поверхности повышается, и в этой благоприятной среде (…им здесь прекрасно - тепло и сыро!) активно размножаются разнообразные бактерии. Поэтому и возникает довольно неприятный подвальный запах в салоне автомобиля. Тонкие натуры (особенно дамы) сразу улавливают некоторый диссонанс между сверкающий салоном, полированным кузовом и этим запахом.',
          'К сожалению, в запущенных случаях гарантию избавления от запаха может дать только демонтаж и полная промывка испарителя. Особенно это касается автомобилей без салонного фильтра и с большим пробегом. Подробно эти проблемы описаны в статье "Некоторые соображения по поводу чистки кондиционера". Как показывает опыт, в связи с большой трудоемкостью, и соответственно высокой стоимостью, на демонтаж испарителя владельцы автомобилей идут крайне редко. Компромиссным вариантом является дезинфекция кондиционера без его разборки. Этот вариант вполне подходит для оборудованных салонным воздушным фильтром автомобилей с не очень большим пробегом. Для обработки используют либо разовые баллончики, либо специальные установки.',
          'Практически все крупные производители автохимии имеют в своем ассортименте специальные составы и оборудование для антибактериальной обработки испарителя.',
          'Преимуществом специальных установок является более качественное распыление в течение длительного времени, в результате чего состав достигает всех уголков системы раздачи воздуха. Еще одним преимуществом использования продукции известных марок является гарантия безопасности и эффективности применяемых химикатов. В нашем сервисном центре используется ультразвуковая установка и состав производства известной бельгийской компании. Для обработки кондиционера установка размещается под бардачком, где обычно находится входное отверстие рециркуляции (забора воздуха из салона автомобиля). Если есть необходимость, для улучшения втягивания воздуха могут быть демонтированы некоторые пластиковые панели под бардачком. После этого включается вентилятор автомобиля и запускается установка. Принцип действия установки прост – используемая для дезинфекции кондиционера жидкость с помощью ультразвука превращается в мельчайшие капельки, которые под действием встроенного вентилятора выносятся из выходной трубы устройства в виде густого тумана. (В описании установки сказано, что диаметр капелек меньше 5 микрон. Наверное, это очень круто!) Туман поступает в систему воздухораздачи, проходит через испаритель, воздуховоды и выходные дефлекторы. На внутренних поверхностях туман конденсируется, и содержащиеся в жидкости активные вещества немедленно начинают уничтожать бактерии, грибки, плесень и прочую органическую нечисть. Для обработки одного автомобиля используется один баллончик фирменного состава. После обработки автомобиль можно немножко проветрить, хотя производитель состава на этом не настаивает.',
          'Для дезинфекции испарителя легкового автомобиля достаточно одного баллончика. Радует, что после обработки в салоне остается довольно приятный ненавязчивый запах, который становится почти не заметен через несколько дней. Этот факт произвел на нас благоприятное впечатление, так как позволяет надеяться, что система борется с запахом не путем его перебивания ядреным ароматом, а путем устранения причины возникновения неприятных запахов. Производитель рекомендует производить антибактериальную обработку испарителя кондиционера один раз в год, и понять его можно. Мы же предоставляем вам решать, когда пришла пора разобраться с нечистью.',
          ] 
        },
      ]
    }),
    methods:{
       
    }
}
</script>
