<template>
   <div>
      <br><br><br><br>
    <v-container fluid grid-list-sm pl-5 pr-5>
      <v-layout v-if="cur>-1" row justify-center display-2>
        <div>Регламент ТО - </div> 
        <div style="color: orange">{{itms[cur].name}}</div>
      </v-layout>
      <v-layout v-else row justify-center display-2>Регламент ТО</v-layout>
      <v-flex pa-3 title grey--text>Регулярное проведение квалифицированного технического обслуживания позволит постоянно поддерживать такие качества, как работоспособность, безопасность и надежность, заложенные конструкторами в принадлежащий Вам автомобиль Toyota. Это также поможет Вам максимально сохранить средства, инвестированные Вами в автомобиль.</v-flex>
      <!-- <v-layout row wrap justify-center> -->
        <div v-if="cur > -1">
            <v-btn color="warning" @click.stop="curRestore">Вернуться к списку машин</v-btn>
            <div>П - Проверка, З - Замена</div>
          
          <v-data-table :headers="hdrs" :items="itms[cur].info" class="elevation-1" hide-actions >
            <template v-slot:items="props">
              <td class="text-xs-center">{{ props.item.num }}</td>
              <td>{{ props.item.works }}</td>
              <td class="text-xs-center">{{ props.item.km10 }}</td>
              <td class="text-xs-center">{{ props.item.km20 }}</td>
              <td class="text-xs-center">{{ props.item.km30 }}</td>
              <td class="text-xs-center">{{ props.item.km40 }}</td>
              <td class="text-xs-center">{{ props.item.km50 }}</td>
              <td class="text-xs-center">{{ props.item.km60 }}</td>
              <td class="text-xs-center">{{ props.item.km70 }}</td>
              <td class="text-xs-center">{{ props.item.km80 }}</td>
              <td class="text-xs-center">{{ props.item.km90 }}</td>
              <td class="text-xs-center">{{ props.item.km100 }}</td>
            </template>
          </v-data-table>
          <v-btn color="warning" @click.stop="curRestore">Вернуться к списку машин</v-btn>
        </div>
        <div v-else>
          <v-layout row wrap justify-center>
            <v-flex v-for="(item,i) in itms" :key="`to${i}`" xs12 sm6 md4 lg3 xl2 pa-2>
            <v-hover>
              <v-card slot-scope="{ hover }" elevation="5" @click="curSet(i)" style="cursor: pointer">
                <v-img :src="item.img">
                  <v-scale-transition>
                    <div v-if="hover" 
                      class="d-flex transition-fast-in-fast-out black" 
                      style="height: 100%; opacity: .5; cursor: pointer">
                      <v-icon v-html="'fa-hand-point-up'" size="500%"></v-icon>
                    </div>
                  </v-scale-transition>
                </v-img>
                <v-card-title><p class="title">{{item.name}}</p></v-card-title>
              </v-card>
            </v-hover>
          </v-flex>
         </v-layout>
        </div>
    </v-container>
    <br><br><br><br>
   </div>
</template>

<script>
import Auris from '../assets/to/Auris.jpg'
import Avensis from '../assets/to/Avensis.jpg'
import Camry from '../assets/to/Camry.jpg'
import Corolla from '../assets/to/Corolla.jpg'
import CorollaVerso from '../assets/to/CorollaVerso.jpg'
import Highlander from '../assets/to/Highlander.jpg'
import Hilux from '../assets/to/Hilux.jpg'
import LandCruiser from '../assets/to/LandCruiser.jpg'
import LandCruiserPrado from '../assets/to/LandCruiserPrado.jpg'
import Prius from '../assets/to/Prius.jpg'
import Rav4 from '../assets/to/Rav4.jpg'
import Sequoia from '../assets/to/Sequoia.jpg'
import Venza from '../assets/to/Venza.jpg'
import Verso from '../assets/to/Verso.jpg'
import Yaris from '../assets/to/Yaris.jpg'

export default {
 data: () => ({
    cur: -1,
    hdrs: [
      { text: '№', sortable: false, value: 'num' },
      { text: 'Список работ', sortable: false, value: 'works' },
      { text: '10 тыс/км', sortable: false, value: 'km10' },
      { text: '20 тыс/км', sortable: false, value: 'km20' },
      { text: '30 тыс/км', sortable: false, value: 'km30' },
      { text: '40 тыс/км', sortable: false, value: 'km40' },
      { text: '50 тыс/км', sortable: false, value: 'km50' },
      { text: '60 тыс/км', sortable: false, value: 'km60' },
      { text: '70 тыс/км', sortable: false, value: 'km70' },
      { text: '80 тыс/км', sortable: false, value: 'km80' },
      { text: '90 тыс/км', sortable: false, value: 'km90' },
      { text: '100 тыс/км', sortable: false, value: 'km100' },
    ],
    itms: [
      { name: 'Auris', img: Auris, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стекол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Свечи зажигания', km10: 'Замена каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '10', works: 'Топливная система', km10: 'Прочистка каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '12', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '13', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '14', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '15', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Сцепления для моделей с МКПП — проверка, замена жидкости', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '18', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Масло в коробке передач — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Проверка жидкости для автоматической трансмиссии', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Рычаг переключения передач для 6-ступенчатой МКПП', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '24', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '26', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '27', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Avensis', img: Avensis, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Cвечи зажигания', km10: 'Замена каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '10', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '11', works: 'Топливная система', km10: 'Прочистка каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '12', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '13', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '14', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '15', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Проверка жидкости сцепления', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'з', km100: 'п'},
        { num: '18', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Проверка жидкости для вариатора Multidrive S', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Рычаг переключения передач для 6-ступенчатой МКПП', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '23', works: 'Проверка масла в МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '24', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '26', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'}
      ]},
      { name: 'Camry', img: Camry, info: [
        { num: '1', works: 'Проверка клапанного зазора (только для двигателя 2,4 л)', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '5', works: 'Система охлаждения двигателя, охлаждающая жидкость двигателя, антифриз - проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п/з'},
        { num: '6', works: 'Жидкость гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '7', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '9', works: 'Свечи зажигания', km10: '        каждые 100 000 км пробега', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '10', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '11', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '12', works: 'Воздушный фильтр', km10: ' п', km20: 'з', km30: 'п ', km40: 'з', km50: 'п ', km60: 'з', km70: ' п', km80: 'з', km90: 'п ', km100: 'з'},
        { num: '13', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '15', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '16', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '17', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '18', works: 'Проверка жидкости сцепления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '19', works: 'Рулевое управление — проверка утечек, люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '20', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '22', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п/з', km50: '', km60: '', km70: '', km80: 'п/з', km90: '', km100: ''},
        { num: '23', works: 'Автоматическая трансмиссия (CVT) вариатор - проверка жидкости', km10: '', km20: '', km30: '', km40: 'п/з', km50: '', km60: '', km70: '', km80: 'п/з', km90: '', km100: ''},
        { num: '24', works: 'Трансмиссионная жидкость в механической коробке передач (МКПП) - замена', km10: '', km20: '', km30: '', km40: 'з', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '25', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '26', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '27', works: 'Внутрисалонный фильтр', km10: 'п', km20: 'з', km30: 'п', km40: 'з', km50: 'п', km60: 'з', km70: 'п', km80: 'з', km90: 'п', km100: 'з'},
        { num: '28', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Corolla', img: Corolla, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стекол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '10', works: 'Топливная система', km10: 'Прочистка каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '12', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '13', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '14', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '15', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Сцепления для моделей с МКПП — проверка, замена жидкости', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '18', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Масло в коробке передач — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Рычаг переключения передач для 6-ступенчатой МКПП', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '24', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '26', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '27', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Сorolla Verso', img: CorollaVerso, info: [
        { num: '1', works: 'Масло моторное / фильтр, замена', km10: 'З', km20: 'З', km30: 'З', km40: 'З', km50: 'З', km60: 'З', km70: 'З', km80: 'З', km90: 'З', km100: 'З'},
        { num: '2', works: 'Зазор клапанов', km10: 'регулировка по необходимости каждые 100.000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '3', works: 'Приводные ремни, проверка', km10: '', km20: 'П', km30: '', km40: 'П', km50: '', km60: 'П', km70: '', km80: 'П', km90: '', km100: 'П'},
        { num: '4', works: 'Трубки и соединения системы охлаждения', km10: '', km20: '', km30: '', km40: 'П', km50: '', km60: '', km70: '', km80: 'П', km90: '', km100: ''},
        { num: '5', works: 'Воздушный фильтр, замена', km10: 'П', km20: 'П', km30: 'П', km40: 'З', km50: 'П', km60: 'П', km70: 'П', km80: 'З', km90: 'П', km100: 'П'},
        { num: '6', works: 'Крышка топливного бака, топливопроводы, соединения', km10: '', km20: 'П', km30: '', km40: 'П', km50: '', km60: 'П', km70: '', km80: 'П', km90: '', km100: 'П'},
        { num: '7', works: 'Свечи зажигания, замена', km10: '', km20: 'З', km30: '', km40: 'З', km50: '', km60: 'З', km70: '', km80: 'З', km90: '', km100: 'З'},
        { num: '8', works: 'Аккумулятор зарядка, плотность электролита, состояние клемм', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '9', works: 'Фильтр внутрисалонной вентиляции, замена', km10: 'П', km20: 'З', km30: 'П', km40: 'З', km50: 'П', km60: 'З', km70: 'П', km80: 'З', km90: 'П', km100: 'З'},
        { num: '10', works: 'Адсорбер паров топлива', km10: '', km20: '', km30: '', km40: 'П', km50: '', km60: '', km70: '', km80: 'П', km90: '', km100: ''},
        { num: '11', works: 'Топливный фильтр (в топливном баке), за искл. хетчбека замена', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'З', km90: '', km100: ''},
        { num: '12', works: 'Наружное освещение', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '13', works: 'Тормозные колодки, диски и др. компоненты дисковых тормозов', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '14', works: 'Тормозная система: уровень жидкости, подтекания', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '15', works: 'Жидкость в тормозной системе, замена', km10: '', km20: '', km30: '', km40: 'З', km50: '', km60: '', km70: '', km80: 'З', km90: '', km100: ''},
        { num: '16', works: 'Масло в механической КПП: подтекания, замена', km10: '', km20: 'П', km30: '', km40: 'З', km50: '', km60: 'П', km70: '', km80: 'З', km90: '', km100: 'П'},
        { num: '17', works: 'Диагностика подвески, рулевого управления и выхлопной системы', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '18', works: 'Проверка системы кондиционирования воздуха салона', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '19', works: 'Смазка петлей замков дверей и замка капота', km10: 'П', km20: 'П', km30: 'П', km40: 'П', km50: 'П', km60: 'П', km70: 'П', km80: 'П', km90: 'П', km100: 'П'},
        { num: '20', works: 'Антифриз SLLC, замена', km10: 'Первая замена 160тыс.км, последующие — каждые 80тыс.км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''}
      ]},
      { name: 'Highlander', img: Highlander, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Проверка уровня охлаждающей жидкости двигателя, омывателей стёкол и фар', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '10', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '11', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '12', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '13', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '14', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '15', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '16', works: 'Рулевое управление — проверка утечек, люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '17', works: 'Протяжка болтов карданных валов', km10: '', km20: 'р', km30: '', km40: 'р', km50: '', km60: 'р', km70: '', km80: 'р', km90: '', km100: 'р'},
        { num: '18', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '19', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '21', works: 'Проверка, замена масла в раздаточной коробке', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '22', works: 'Проверка, замена масла заднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '23', works: 'Проверка шины и давления в шинах', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '26', works: 'Проверка работы системы кондиционирования и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Hilux', img: Hilux, info: [
        { num: '1', works: 'Проверка клапанного зазора', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: 'Заменить, когда на приборной панели загорится индикация о замене фильтра', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '10', works: 'Топливный фильтр-отстойник', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '11', works: 'Воздушный фильтр (включая проверку предочистки, если установлена)', km10: 'Проверка осуществляется каждые 5 000км, замена — каждые 30 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '12', works: 'Продувка расходомера воздуха', km10: '', km20: '', km30: '', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: '', km100: ''},
        { num: '13', works: 'Проверка оборотов холостого хода', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Проверка дымности выхлопных газов', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '15', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '17', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '18', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '20', works: 'Проверка, замена жидкости сцепления (для автомобилей с МКПП)', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '21', works: 'Рулевое управление — проверка отсутствия утечек, люфтов, состояния пыльников, легкости вращения рулевого колеса', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '22', works: 'Смазка карданных валов и протяжка болтов карданных валов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '23', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '26', works: 'Проверка масла МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '27', works: 'Проверка масла в раздаточной коробке', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '28', works: 'Проверка, замена масла переднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '29', works: 'Проверка, замена масла заднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '30', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '31', works: 'Проверка наружных и внутренних световых приборов, звукового сигнала, стеклоочистителей и омывателей', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '32', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '33', works: 'Проверка работы системы кондиционирования и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Land Cruiser', img: LandCruiser, info: [
        { num: '1', works: 'Проверка клапанного зазора', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '9', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '10', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр (включая проверку устройства предварительной очистки воздуха, если установлено)', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '12', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '13', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '14', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '15', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Рулевое управление — проверка отсутствия утечек, люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '18', works: 'Смазка карданных валов и проверка момента затяжки болтов карданных валов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '19', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Проверка масла раздаточной коробки', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Проверка, замена масла переднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '24', works: 'Проверка, замена масла заднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '25', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '26', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '27', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '28', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Land Cruiser Prado', img: LandCruiserPrado, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стекол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Свечи зажигания', km10: 'Замена каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '10', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '11', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '12', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '13', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '14', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '15', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '16', works: 'Проверка, замена жидкости сцепления для моделей с МКПП', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '18', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '19', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Рычаг переключения передач для моделей с 6-ти ступенчатой МКПП', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '21', works: 'Масло в коробке передач — проверка для моделей с МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Проверка жидкости для вариатора Multidrive S', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '26', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Prius', img: Prius, info: [
        { num: '1', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '2', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '3', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '5', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Свечи зажигания', km10: 'Замена каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '7', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '8', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '9', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '10', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '11', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '12', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '13', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '15', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '17', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '18', works: 'Проверка жидкости для гибридной трансмиссии', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '19', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '22', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Rav-4', img: Rav4, info: [
        { num: '1', works: 'Проверка клапанного зазора (только для автомобилей с двигателем 2AZ-FE)', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Проверка, регулировка приводных ремней', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '9', works: 'Аккумуляторная батарея — проверка заряда , уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '10', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр', km10: '', km20: 'з', km30: '', km40: 'з', km50: '', km60: 'з', km70: '', km80: 'з', km90: '', km100: 'з'},
        { num: '12', works: 'Топливная система', km10: 'Прочистка каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '13', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '15', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '16', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '17', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '18', works: 'Проверка, замена жидкости сцепления (для 6-ступенчатой МКПП) )', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '19', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '20', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '22', works: 'Проверка рычага переключения передач (для 6-ступенчатой МКПП)', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '23', works: 'Проверка жидкости вариатора Multidrive S', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '24', works: 'Проверка жидкости в автоматической трансмиссии', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '25', works: 'Проверка масла МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '26', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '27', works: 'Проверка/замена масла в раздаточной коробке только (только для автомобилей с полным приводом)', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '28', works: 'Проверка/замена масла заднего дифференциала (только для автомобилей с полным приводом)', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '29', works: 'Шины — проверка состояния и давления', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '30', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '31', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '32', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Sequoia', img: Sequoia, info: [
        { num: '1', works: 'Проверка клапанного зазора (только для автомобилей с двигателем 2AZ-FE)', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Проверка, регулировка приводных ремней', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '9', works: 'Аккумуляторная батарея — проверка заряда , уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '10', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр', km10: '', km20: 'з', km30: '', km40: 'з', km50: '', km60: 'з', km70: '', km80: 'з', km90: '', km100: 'з'},
        { num: '12', works: 'Топливная система', km10: 'Прочистка каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '13', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '15', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '16', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '17', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '18', works: 'Проверка, замена жидкости сцепления (для 6-ступенчатой МКПП) )', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '19', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '20', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '22', works: 'Проверка рычага переключения передач (для 6-ступенчатой МКПП)', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '23', works: 'Проверка жидкости вариатора Multidrive S', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '24', works: 'Проверка жидкости в автоматической трансмиссии', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '25', works: 'Проверка масла МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '26', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '27', works: 'Проверка/замена масла в раздаточной коробке только (только для автомобилей с полным приводом)', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '28', works: 'Проверка/замена масла заднего дифференциала (только для автомобилей с полным приводом)', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '29', works: 'Шины — проверка состояния и давления', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '30', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '31', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '32', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Venza', img: Venza, info: [
        { num: '1', works: 'Проверка клапанного зазора', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '2', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: 'з', km30: '', km40: 'з', km50: '', km60: 'з', km70: '', km80: 'з', km90: '', km100: 'з'},
        { num: '10', works: 'Топливный фильтр-отстойник', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '11', works: 'Воздушный фильтр (включая проверку устройства предварительной очистки воздуха, если установлено)', km10: 'Проверка осуществляется каждые 5000 км, замена — каждые 30 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '12', works: 'Продувка расходомера воздуха', km10: '', km20: '', km30: '', km40: '', km50: '', km60: 'пр', km70: '', km80: '', km90: '', km100: ''},
        { num: '13', works: 'Проверка оборотов холостого хода', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '14', works: 'Проверка дымности выхлопных газов', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '15', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '17', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '18', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '20', works: 'Рулевое управление: проверка отсутствия утечек, люфтов, состояния пыльников, легкости вращения рулевого колеса', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Смазка карданных валов и проверка момента затяжки болтов карданных валов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '22', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '23', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '25', works: 'Проверка масла в раздаточной коробке', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '26', works: 'Проверка, замена масла переднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '27', works: 'Проверка, замена масла заднего дифференциала', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '28', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '29', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '30', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '31', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Verso', img: Verso, info: [
        { num: '1', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '2', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '3', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стекол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '4', works: 'Узлы и агрегаты автомобиля — проверка на предмет утечек и внешних повреждений', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '6', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Свечи зажигания', km10: 'Замена каждые 100 000 км', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: ''},
        { num: '8', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '9', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '10', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '11', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '12', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '13', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '14', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '15', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '16', works: 'Проверка, замена жидкости сцепления для моделей с МКПП', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Рулевое управление — проверка люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '18', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '19', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Рычаг переключения передач для моделей с 6-ти ступенчатой МКПП', km10: '', km20: '', km30: 'п', km40: '', km50: '', km60: 'п', km70: '', km80: '', km90: 'п', km100: ''},
        { num: '21', works: 'Масло в коробке передач — проверка для моделей с МКПП', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Проверка жидкости для вариатора Multidrive S', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '26', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
      { name: 'Yaris', img: Yaris, info: [
        { num: '1', works: 'Проверка клапанного зазора (только для двигателя 2,4 л)', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '2', works: 'Приводные ремни — проверка, регулировка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '3', works: 'Моторное масло, масляный фильтр двигателя', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '4', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '5', works: 'Охлаждающая жидкость двигателя, гидроусилителя руля, омывателей стёкол и фар — проверка уровня', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '6', works: 'Радиатор — проверка чистоты, проверка соединений шлангов и их правильного расположения, наличия коррозии и т.п.', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '7', works: 'Системы выпуска отработавших газов — проверка на герметичность', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '8', works: 'Свечи зажигания', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: '', km90: '', km100: 'з'},
        { num: '9', works: 'Аккумуляторная батарея — проверка заряда, уровня и плотности электролита, состояния клемм', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '10', works: 'Топливный фильтр', km10: '', km20: '', km30: '', km40: '', km50: '', km60: '', km70: '', km80: 'з', km90: '', km100: ''},
        { num: '11', works: 'Воздушный фильтр', km10: '', km20: 'п', km30: '', km40: 'з', km50: '', km60: 'п', km70: '', km80: 'з', km90: '', km100: 'п'},
        { num: '12', works: 'Крышка топливного бака, топливопроводов — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '13', works: 'Адсорбер паров топлива — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '14', works: 'Тормозная система — проверка педали тормоза, состояния тормозных колодок, дисков, суппортов, хода рычага стояночного тормоза, отсутствия утечек, состояния трубопроводов, шлангов, соединений, цилиндров, очистка и смазка тормозных механизмов', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '15', works: 'Стояночный тормоз — проверка', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '16', works: 'Тормозная жидкость — проверка, замена', km10: 'п', km20: 'п', km30: 'п', km40: 'з', km50: 'п', km60: 'п', km70: 'п', km80: 'з', km90: 'п', km100: 'п'},
        { num: '17', works: 'Проверка жидкости сцепления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '18', works: 'Рулевое управление — проверка утечек, люфтов, состояния пыльников, лёгкости вращения рулевого колеса', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'},
        { num: '19', works: 'Приводные валы и пыльники приводных валов — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '20', works: 'Шарниры подвесок, пыльники шарниров, люфты ступичных подшипников — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '21', works: 'Автоматическая трансмиссия (АКПП) — проверка жидкости', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '22', works: 'Масло в коробке передач — проверка', km10: '', km20: '', km30: '', km40: 'п', km50: '', km60: '', km70: '', km80: 'п', km90: '', km100: ''},
        { num: '23', works: 'Шины — проверка состояния и давления', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '24', works: 'Наружные и внутренние световые приборы, звуковые сигналы, стеклоочистители и омыватели — проверка', km10: 'п', km20: 'п', km30: 'п', km40: 'п', km50: 'п', km60: 'п', km70: 'п', km80: 'п', km90: 'п', km100: 'п'},
        { num: '25', works: 'Внутрисалонный фильтр', km10: 'з', km20: 'з', km30: 'з', km40: 'з', km50: 'з', km60: 'з', km70: 'з', km80: 'з', km90: 'з', km100: 'з'},
        { num: '26', works: 'Системы кондиционирования — проверка работы и уровня хладагента', km10: '', km20: 'п', km30: '', km40: 'п', km50: '', km60: 'п', km70: '', km80: 'п', km90: '', km100: 'п'}
      ]},
    ],
  }),
  methods:{
    curSet(i){
      this.cur = i;
      window.scrollTo(0, top);
    },
    curRestore(){
      this.cur = -1;
      window.scrollTo(0, top);
    }
  }
}
</script>
