<template>
<div>
    <v-container text-xs-center>
        <p class="display-1">О КОМПАНИИ</p>
        <p class="headline">У нас есть все о чем мечтает Ваша машина!</p>
        <p class="subheading">Фирма TOYODA существует уже 20 лет. Мы одни из первых, кто предоставил полный цикл сервиса японским машинам в Омске. На протяжении долгих лет накапливалась база знаний и опыта, которую мы предоставляем нашим клиентам. 
    Название нашей фирмы берет начало в 1950х годах. Когда Сакити Тоёда и его сын Киитиро Тоёда - первопроходцы своего дела, положили начало Японскому автопрому.</p>
        <p class="headline">TOYODA</p>
        <p class="subheading">Это сеть СТО и автомагазинов моторных и трансмиссионных масел, автохимии и автокосметики ведущих мировых производителей, специальных жидкостей, автоламп и аксессуаров.
        Наши фелиалы располагают боксами для экспресс-обслуживания: замена технических жидкостей и расходных материалов, а также мелкосрочного ремонта автомобилей зарубежного и российского производства.
        Наша команда придерживается индивидуального подхода и уделяет особое внимание деталям.
        В нашу сеть входит 4 розничных магазина и 2 технические станции, расположенные по всему городу.
        Регулярные акции, розыгрыши и конкурсы, ставшие нашей визитной карточкой, позволяют нашим клиентам приобретать товары по низким ценам и получать приятные и полезные подарки.</p>
    </v-container>  
    <v-container fluid grid-list-md text-xs-center>
      <v-layout row wrap>
        <v-flex xs12 sm6 md3>
            <v-icon size="7em">fa-thumbs-up</v-icon>
            <p class="subheading">Нам можно доверять! Мы на рынке более 20 лет</p>
        </v-flex>
        <v-flex xs12 sm6 md3>
            <v-icon size="7em">fa-truck</v-icon>
            <p class="subheading">Только проверенные и надежные поставщики</p>
        </v-flex>
        <v-flex xs12 sm6 md3>
            <v-icon size="7em">fa-wallet</v-icon>
            <p class="subheading">Наличный и безналичный расчет</p>
        </v-flex>
        <v-flex xs12 sm6 md3>
            <v-icon size="7em">fa-map-marker-alt</v-icon>
            <p class="subheading">Удобное расположение на карте</p>
        </v-flex>
      </v-layout>
    </v-container>
</div>
</template>
<script>
export default {
  data () {
      return {
        
      }
    }
}
</script>
